###############################################################
#  Generated by:      Cadence Innovus 18.11-s100_1
#  OS:                Linux x86_64(Host ID soc07)
#  Generated on:      Sun Sep 17 16:14:38 2023
#  Design:            CHIP
#  Command:           saveDesign Layout/route_117
###############################################################
current_design CHIP
create_clock [get_ports {I_clk}]  -name clk -period 20.000000 -waveform {10.000000 20.000000}
set_propagated_clock  [get_clocks {clk}]
set_propagated_clock  [get_ports {I_clk}]
set_drive 1  [get_ports {I_clk}]
set_drive 1  [get_ports {I_rst}]
set_load -pin_load -max  1  [get_ports {O_done}]
set_load -pin_load -min  1  [get_ports {O_done}]
set_load -pin_load -max  1  [get_ports {IO_F_IO_A[7]}]
set_load -pin_load -min  1  [get_ports {IO_F_IO_A[7]}]
set_load -pin_load -max  1  [get_ports {IO_F_IO_A[6]}]
set_load -pin_load -min  1  [get_ports {IO_F_IO_A[6]}]
set_load -pin_load -max  1  [get_ports {IO_F_IO_A[5]}]
set_load -pin_load -min  1  [get_ports {IO_F_IO_A[5]}]
set_load -pin_load -max  1  [get_ports {IO_F_IO_A[4]}]
set_load -pin_load -min  1  [get_ports {IO_F_IO_A[4]}]
set_load -pin_load -max  1  [get_ports {IO_F_IO_A[3]}]
set_load -pin_load -min  1  [get_ports {IO_F_IO_A[3]}]
set_load -pin_load -max  1  [get_ports {IO_F_IO_A[2]}]
set_load -pin_load -min  1  [get_ports {IO_F_IO_A[2]}]
set_load -pin_load -max  1  [get_ports {IO_F_IO_A[1]}]
set_load -pin_load -min  1  [get_ports {IO_F_IO_A[1]}]
set_load -pin_load -max  1  [get_ports {IO_F_IO_A[0]}]
set_load -pin_load -min  1  [get_ports {IO_F_IO_A[0]}]
set_load -pin_load -max  1  [get_ports {O_F_CLE_A}]
set_load -pin_load -min  1  [get_ports {O_F_CLE_A}]
set_load -pin_load -max  1  [get_ports {O_F_ALE_A}]
set_load -pin_load -min  1  [get_ports {O_F_ALE_A}]
set_load -pin_load -max  1  [get_ports {O_F_REN_A}]
set_load -pin_load -min  1  [get_ports {O_F_REN_A}]
set_load -pin_load -max  1  [get_ports {O_F_WEN_A}]
set_load -pin_load -min  1  [get_ports {O_F_WEN_A}]
set_drive 1  [get_ports {I_F_RB_A}]
set_load -pin_load -max  1  [get_ports {IO_F_IO_B[7]}]
set_load -pin_load -min  1  [get_ports {IO_F_IO_B[7]}]
set_load -pin_load -max  1  [get_ports {IO_F_IO_B[6]}]
set_load -pin_load -min  1  [get_ports {IO_F_IO_B[6]}]
set_load -pin_load -max  1  [get_ports {IO_F_IO_B[5]}]
set_load -pin_load -min  1  [get_ports {IO_F_IO_B[5]}]
set_load -pin_load -max  1  [get_ports {IO_F_IO_B[4]}]
set_load -pin_load -min  1  [get_ports {IO_F_IO_B[4]}]
set_load -pin_load -max  1  [get_ports {IO_F_IO_B[3]}]
set_load -pin_load -min  1  [get_ports {IO_F_IO_B[3]}]
set_load -pin_load -max  1  [get_ports {IO_F_IO_B[2]}]
set_load -pin_load -min  1  [get_ports {IO_F_IO_B[2]}]
set_load -pin_load -max  1  [get_ports {IO_F_IO_B[1]}]
set_load -pin_load -min  1  [get_ports {IO_F_IO_B[1]}]
set_load -pin_load -max  1  [get_ports {IO_F_IO_B[0]}]
set_load -pin_load -min  1  [get_ports {IO_F_IO_B[0]}]
set_load -pin_load -max  1  [get_ports {O_F_CLE_B}]
set_load -pin_load -min  1  [get_ports {O_F_CLE_B}]
set_load -pin_load -max  1  [get_ports {O_F_ALE_B}]
set_load -pin_load -min  1  [get_ports {O_F_ALE_B}]
set_load -pin_load -max  1  [get_ports {O_F_REN_B}]
set_load -pin_load -min  1  [get_ports {O_F_REN_B}]
set_load -pin_load -max  1  [get_ports {O_F_WEN_B}]
set_load -pin_load -min  1  [get_ports {O_F_WEN_B}]
set_drive 1  [get_ports {I_F_RB_B}]
set_drive 1  [get_ports {I_KEY[3]}]
set_drive 1  [get_ports {I_KEY[2]}]
set_drive 1  [get_ports {I_KEY[1]}]
set_drive 1  [get_ports {I_KEY[0]}]
set_drive 1  [get_ports {IO_F_IO_B[0]}]
set_drive 1  [get_ports {IO_F_IO_B[5]}]
set_drive 1  [get_ports {IO_F_IO_A[4]}]
set_drive 1  [get_ports {IO_F_IO_A[2]}]
set_drive 1  [get_ports {IO_F_IO_B[3]}]
set_drive 1  [get_ports {IO_F_IO_A[7]}]
set_drive 1  [get_ports {IO_F_IO_B[1]}]
set_drive 1  [get_ports {IO_F_IO_A[0]}]
set_drive 1  [get_ports {IO_F_IO_A[5]}]
set_drive 1  [get_ports {IO_F_IO_A[3]}]
set_drive 1  [get_ports {IO_F_IO_A[1]}]
set_drive 1  [get_ports {IO_F_IO_B[6]}]
set_drive 1  [get_ports {IO_F_IO_B[4]}]
set_drive 1  [get_ports {IO_F_IO_B[2]}]
set_drive 1  [get_ports {IO_F_IO_B[7]}]
set_drive 1  [get_ports {IO_F_IO_A[6]}]
set_input_delay -add_delay 0.2 -min -clock [get_clocks {clk}] [get_ports {IO_F_IO_B[5]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {IO_F_IO_B[5]}]
set_input_delay -add_delay 0.2 -min -clock [get_clocks {clk}] [get_ports {I_rst}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {I_rst}]
set_input_delay -add_delay 0.2 -min -clock [get_clocks {clk}] [get_ports {IO_F_IO_B[3]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {IO_F_IO_B[3]}]
set_input_delay -add_delay 0.2 -min -clock [get_clocks {clk}] [get_ports {I_F_RB_A}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {I_F_RB_A}]
set_input_delay -add_delay 0.2 -min -clock [get_clocks {clk}] [get_ports {IO_F_IO_B[1]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {IO_F_IO_B[1]}]
set_input_delay -add_delay 0.2 -min -clock [get_clocks {clk}] [get_ports {IO_F_IO_A[6]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {IO_F_IO_A[6]}]
set_input_delay -add_delay 0.2 -min -clock [get_clocks {clk}] [get_ports {I_F_RB_B}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {I_F_RB_B}]
set_input_delay -add_delay 0.2 -min -clock [get_clocks {clk}] [get_ports {IO_F_IO_A[4]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {IO_F_IO_A[4]}]
set_input_delay -add_delay 0.2 -min -clock [get_clocks {clk}] [get_ports {IO_F_IO_A[2]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {IO_F_IO_A[2]}]
set_input_delay -add_delay 0.2 -min -clock [get_clocks {clk}] [get_ports {I_KEY[3]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {I_KEY[3]}]
set_input_delay -add_delay 0.2 -min -clock [get_clocks {clk}] [get_ports {IO_F_IO_A[0]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {IO_F_IO_A[0]}]
set_input_delay -add_delay 0.2 -min -clock [get_clocks {clk}] [get_ports {I_KEY[1]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {I_KEY[1]}]
set_input_delay -add_delay 0.2 -min -clock [get_clocks {clk}] [get_ports {IO_F_IO_B[6]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {IO_F_IO_B[6]}]
set_input_delay -add_delay 0.2 -min -clock [get_clocks {clk}] [get_ports {IO_F_IO_B[4]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {IO_F_IO_B[4]}]
set_input_delay -add_delay 0.2 -min -clock [get_clocks {clk}] [get_ports {IO_F_IO_B[2]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {IO_F_IO_B[2]}]
set_input_delay -add_delay 0.2 -min -clock [get_clocks {clk}] [get_ports {IO_F_IO_B[0]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {IO_F_IO_B[0]}]
set_input_delay -add_delay 0.2 -min -clock [get_clocks {clk}] [get_ports {IO_F_IO_A[7]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {IO_F_IO_A[7]}]
set_input_delay -add_delay 0.2 -min -clock [get_clocks {clk}] [get_ports {IO_F_IO_A[5]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {IO_F_IO_A[5]}]
set_input_delay -add_delay 0.2 -min -clock [get_clocks {clk}] [get_ports {IO_F_IO_A[3]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {IO_F_IO_A[3]}]
set_input_delay -add_delay 0.2 -min -clock [get_clocks {clk}] [get_ports {IO_F_IO_A[1]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {IO_F_IO_A[1]}]
set_input_delay -add_delay 0.2 -min -clock [get_clocks {clk}] [get_ports {I_KEY[2]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {I_KEY[2]}]
set_input_delay -add_delay 0.2 -min -clock [get_clocks {clk}] [get_ports {I_KEY[0]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {I_KEY[0]}]
set_input_delay -add_delay 0.2 -min -clock [get_clocks {clk}] [get_ports {IO_F_IO_B[7]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {IO_F_IO_B[7]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {IO_F_IO_B[5]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {IO_F_IO_B[5]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {O_F_CLE_A}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {O_F_CLE_A}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {IO_F_IO_B[3]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {IO_F_IO_B[3]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {IO_F_IO_B[1]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {IO_F_IO_B[1]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {O_F_CLE_B}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {O_F_CLE_B}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {IO_F_IO_A[6]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {IO_F_IO_A[6]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {IO_F_IO_A[4]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {IO_F_IO_A[4]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {IO_F_IO_A[2]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {IO_F_IO_A[2]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {IO_F_IO_A[0]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {IO_F_IO_A[0]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {O_F_ALE_A}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {O_F_ALE_A}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {IO_F_IO_B[6]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {IO_F_IO_B[6]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {IO_F_IO_B[4]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {IO_F_IO_B[4]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {O_F_ALE_B}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {O_F_ALE_B}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {IO_F_IO_B[2]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {IO_F_IO_B[2]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {IO_F_IO_B[0]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {IO_F_IO_B[0]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {IO_F_IO_A[7]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {IO_F_IO_A[7]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {O_F_WEN_A}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {O_F_WEN_A}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {IO_F_IO_A[5]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {IO_F_IO_A[5]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {O_F_REN_A}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {O_F_REN_A}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {IO_F_IO_A[3]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {IO_F_IO_A[3]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {O_done}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {O_done}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {IO_F_IO_A[1]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {IO_F_IO_A[1]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {O_F_WEN_B}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {O_F_WEN_B}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {O_F_REN_B}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {O_F_REN_B}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {IO_F_IO_B[7]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {IO_F_IO_B[7]}]
